Торговля_11__демо/src/InformationRegisters/НастройкиСистемыНалогообложения/НастройкиСистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСистемыНалогообложения</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеНомерУСН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеДатаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяПСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяАУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДССМежценовойРазницы</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/InformationRegisters/НастройкиСистемыНалогообложения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значения по умолчанию для ресурсов регистра.
// Имена ключей структуры должны строго соответствовать именам ресурсов регистра.
// 
// Параметры:
// Возвращаемое значение:
// 	Структура - структура значений ресурсов регистра.
Функция ЗначенияПоУмолчанию() Экспорт
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.Общая);
	СтруктураЗначений.Вставить("ПрименяетсяЕНВД", Ложь);
	СтруктураЗначений.Вставить("ЯвляетсяПлательщикомНДПИ", Ложь);
	СтруктураЗначений.Вставить("ПрименяетсяУСН", Ложь);
	СтруктураЗначений.Вставить("ПлательщикНалогаНаПрибыль", Ложь);
	СтруктураЗначений.Вставить("ДатаПереходаНаУСН", Неопределено);
	СтруктураЗначений.Вставить("УведомлениеНомерУСН", Неопределено);
	СтруктураЗначений.Вставить("УведомлениеДатаУСН", Неопределено);
	СтруктураЗначений.Вставить("ПрименяетсяПСН", Ложь);
	СтруктураЗначений.Вставить("ПрименяетсяАУСН", Ложь);
	СтруктураЗначений.Вставить("ПлательщикЕНП", Ложь);
	СтруктураЗначений.Вставить("УчетнаяПолитикаСуществует", Ложь);
	
	Возврат СтруктураЗначений
КонецФункции

// Возращает текст запроса по данным регистра.
// 
// Возвращаемое значение:
// 	Строка - Текст запроса.
Функция ТекстЗапросаДействующиеПараметрыНалоговУчетныхПолитик() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР КОГДА ТаблицаСрезПоследних.Период ЕСТЬ NULL Тогда
	|		ЛОЖЬ
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ КАК УчетнаяПолитикаСуществует,
	|	ТаблицаСрезПоследних.Период КАК Период,
	|	ГоловныеОрганизации.ОбособленноеПодразделение КАК Организация,
	|	ТаблицаСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ТаблицаСрезПоследних.ПрименяетсяЕНВД КАК ПрименяетсяЕНВД,
	|	ТаблицаСрезПоследних.ПрименяетсяУСН КАК ПрименяетсяУСН,
	|	ТаблицаСрезПоследних.ПлательщикНалогаНаПрибыль КАК ПлательщикНалогаНаПрибыль,
	|	ТаблицаСрезПоследних.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	ТаблицаСрезПоследних.ДатаПереходаНаУСН КАК ДатаПереходаНаУСН,
	|	ТаблицаСрезПоследних.УведомлениеНомерУСН КАК УведомлениеНомерУСН,
	|	ТаблицаСрезПоследних.УведомлениеДатаУСН КАК УведомлениеДатаУСН,
	|	(ВЫБОР
	|		КОГДА ТаблицаСрезПоследних.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС) КОНЕЦ) КАК НалогообложениеНДСПоУмолчанию,
	|	ТаблицаСрезПоследних.ПрименяетсяПСН КАК ПрименяетсяПСН,
	|	ТаблицаСрезПоследних.ПрименяетсяАУСН КАК ПрименяетсяАУСН,
	|	ТаблицаСрезПоследних.ПлательщикЕНП КАК ПлательщикЕНП
	|ИЗ
	|	ВтГоловныеОрганизации КАК ГоловныеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, Организация В
	|			(ВЫБРАТЬ
	|				ГоловныеОрганизации.Организация
	|			ИЗ
	|				ВтГоловныеОрганизации КАК ГоловныеОрганизации)) КАК ТаблицаСрезПоследних
	|		ПО ГоловныеОрганизации.Организация = ТаблицаСрезПоследних.Организация
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

// Формирует текстовое описание установленных параметров.
// 
// Параметры:
// 	Организация - СправочникСсылка.Организации - ссылка на организацию.
// 	ДатаДействия - Дата - период действия настроек.
// 	ДействующиеНастройки - Структура - действующие параметры учетной политики.
// Возвращаемое значение:
// 	Строка - Описание действующих параметров строкой.
Функция ОписаниеДействующихПараметров(Организация, ДатаДействия = Неопределено, ДействующиеНастройки = Неопределено) Экспорт
	
	Если ДействующиеНастройки = Неопределено Тогда
		ДействующиеНастройки = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиСистемыНалогообложения",
			Организация,
			ДатаДействия,
			Ложь);
	КонецЕсли;
	СтрокаШаблон = "%1: %2." + Символы.ПС;
	СтрокаШаблонБулево = "%1." + Символы.ПС;
	Если НЕ ЗначениеЗаполнено(ДействующиеНастройки) Тогда
		СтрокаОписанияНастроек = НСтр("ru='Не заданы параметры.'");
		Возврат СтрокаОписанияНастроек;
	КонецЕсли;
	
	СтрокаОписанияНастроек = СтрШаблон(СтрокаШаблон, 
		НСтр("ru='Система налогообложения'"),
		ДействующиеНастройки.СистемаНалогообложения);
	
	Если ДействующиеНастройки.ПрименяетсяЕНВД Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек
			+ СтрШаблон(СтрокаШаблонБулево,
				НСтр("ru='Организация является плательщиком ЕНВД'"));
	КонецЕсли;
	
	Если ДействующиеНастройки.ЯвляетсяПлательщикомНДПИ Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек
			+ СтрШаблон(СтрокаШаблонБулево,
				НСтр("ru='Является плательщиком НДПИ по процентной ставке'"));
	КонецЕсли;
	
	Если ДействующиеНастройки.ПрименяетсяПСН Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек
			+ СтрШаблон(СтрокаШаблонБулево,
				НСтр("ru='Организация применяет патентную систему налогообложения (ПСН)'"));
	КонецЕсли;
	
	Если ДействующиеНастройки.ПрименяетсяАУСН Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек
			+ СтрШаблон(СтрокаШаблонБулево,
				НСтр("ru='Организация применяет автоматизированную упрощенную систему налогообложения (АУСН)'"));
	КонецЕсли;
	
	Если ДействующиеНастройки.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		Если ЗначениеЗаполнено(ДействующиеНастройки.ДатаПереходаНаУСН) Тогда
			СтрокаОписанияНастроек = СтрокаОписанияНастроек
				+ СтрШаблон(СтрокаШаблон,
					НСтр("ru='Дата перехода на УСН'"),
					Формат(ДействующиеНастройки.ДатаПереходаНаУСН,"ДЛФ=DD;"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДействующиеНастройки.УведомлениеНомерУСН) Тогда
			СтрокаОписанияНастроек = СтрокаОписанияНастроек
				+ СтрШаблон(СтрокаШаблон,
					НСтр("ru='Уведомление о переходе на УСН №'"),
					ДействующиеНастройки.УведомлениеНомерУСН);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДействующиеНастройки.УведомлениеДатаУСН) Тогда
			СтрокаОписанияНастроек = СтрокаОписанияНастроек
				+ СтрШаблон(СтрокаШаблон,
					НСтр("ru='Дата уведомления о переходе на УСН'"),
					Формат(ДействующиеНастройки.УведомлениеДатаУСН,"ДЛФ=DD;"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДействующиеНастройки.ПлательщикЕНП Тогда
		СтрокаОписанияНастроек = СтрокаОписанияНастроек
			+ СтрШаблон(СтрокаШаблонБулево,
				НСтр("ru='Организация использует единый налоговый платеж при уплате налогов'"));
	КонецЕсли;
	
	Возврат СтрокаОписанияНастроек
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
